{
  "HELLO": "Olá! Eu sou",
  "ALINE_NINK": "Aline Nink",
  "SUBTITLE": "Desenvolvedora Front-End",
  "ABOUT_ME": "Sobre Mim",
  "English": "Inglês",
  "Portuguese": "Português",
  "Here’s a quick glance at my journey so far.": "Aqui está um breve resumo da minha trajetória até agora.",
  "technologies": {
    "title": "Habilidades",
    "subtitle": "Tecnologias e habilidades que domino",
    "hardSkills": {
      "title": "Habilidades em Destaque",
      "angularJs": "Angular JS",
      "angular": "Angular (até versão 18)",
      "css": "CSS (UX, CSS3, LESS, SASS, Bootstrap)",
      "html": "HTML",
      "apiIntegration": "Integrações API REST e GraphQL",
      "git": "Git",
      "javascript": "JavaScript",
      "testing": "Jasmine, Jest e Karma (Testes Unitários)",
      "methodologies": "Metodologias Ágeis",
      "ngrx": "NgRx",
      "typescript": "TypeScript",
      "microFrontend": "Arquitetura Micro-frontend",
      "english": "Inglês",
      "azure": "Azure",
      "jenkins": "Jenkins (CI/CD)",
      "kubernetes": "Kubernetes"
    },
    "softSkills": {
      "title": "Habilidades em Desenvolvimento",
      "react": "React",
      "nextjs": "Next.js",
      "tailwind": "Tailwind CSS",
      "sql": "SQL",
      "nodejs": "Node.js",
      "java": "Java",
      "aws": "AWS",
      "vuejs": "Vue.js"
    }
  },

  "contact": {
    "title": "Fale Comigo",
    "subtitle": "Sinta-se à vontade para entrar em contato através das opções abaixo:",
    "whatsapp": "Converse no WhatsApp",
    "email": "Email",
    "linkedin": "LinkedIn"
  },
  "home": "Início",
  "aboutMe": "Sobre Mim",
  "skills": "Habilidades",
  "projects": "Projetos",
  "contactHeader": "Contato",
  "english": "Inglês",
  "portuguese": "Português",
  "allRightsReserved": "Todos os direitos reservados.",
  "madeBy": "Feito com",
  "alineNink": "Aline Nink",
  "linkedIn": "LinkedIn",
  "gitHub": "GitHub",
  "email": "Email",
  "graduation": "Graduação em Gestão de Tecnologia da Informação",
  "graduationDescription": "Concluí minha graduação em Gestão de Tecnologia da Informação pela Fatec Itaquaquecetuba, desenvolvendo uma base sólida para atuar na área de tecnologia.",
  "beginnerExperience": "Início da Carreira",
  "beginnerDescription": "Iniciei minha carreira como Desenvolvedora Júnior, trabalhando com Angular 7, TypeScript e HTML5 para criar interfaces dinâmicas.",
  "intermediateExperience": "Experiência Intermediária",
  "intermediateDescription": "Progredi para Desenvolvedora Pleno, contribuindo em projetos do setor financeiro com Angular 9 e GraphQL.",
  "postgraduateAgile": "Especialização em Metodologias Ágeis",
  "postgraduateAgileDescription": "Completei minha pós-graduação em Desenvolvimento de Software com Metodologias Ágeis pela Universidade Anhembi Morumbi.",
  "advancedExperience": "Experiência Avançada",
  "advancedDescription": "Atuei como Desenvolvedora Sênior, liderando projetos de alta complexidade no setor imobiliário utilizando Angular e NgRx.",
  "postgraduateUX": "Especialização em User Experience",
  "postgraduateUXDescription": "Aprofundei meus conhecimentos em design centrado no usuário com uma especialização em UX pela Anhembi Morumbi.",
  "techLeadExperience": "Experiência como Tech Lead",
  "techLeadDescription": "Atualmente atuo como Tech Lead Front-end, liderando equipes e entregando soluções eficientes para clientes do setor financeiro e imobiliário.",
  "projectsTitle": "Meus Projetos",
  "projectsSubtitle": "Aqui estão alguns dos projetos pessoais que desenvolvi.",
  "description": "Descrição",
  "technologiesUsed": "Tecnologias Utilizadas",
  "financialDashboard": "Dashboard de Finanças Pessoais",
  "financialDashboardDescriptionP1": "O Dashboard de Finanças Pessoais é uma ferramenta completa e intuitiva, projetada para transformar a gestão das suas finanças em uma experiência fluida e esclarecedora. Com uma interface moderna e amigável, ele permite o registro detalhado de receitas e despesas organizadas por categorias, possibilitando um controle rigoroso do seu fluxo financeiro.",
  "financialDashboardDescriptionP2": "Além disso, o dashboard oferece históricos de transações minuciosos, permitindo análises profundas dos seus hábitos de consumo ao longo do tempo. Gráficos interativos e dinâmicos ilustram tendências, projeções futuras e percentuais de gastos, transformando dados brutos em insights valiosos para a tomada de decisões mais acertadas.",
  "financialDashboardDescriptionP3": "Desenvolvido com as tecnologias React.js, Redux e Chart.js, o Personal Finance Dashboard é totalmente responsivo, garantindo uma experiência de uso impecável em qualquer dispositivo. Para maior conforto e personalização, o sistema dispõe de modos claro e escuro, adaptando-se às suas preferências visuais e ao ambiente em que você se encontra.",
  "ecommercePlatform": "Plataforma de E-commerce",
  "ecommercePlatformDescription": "A Plataforma de E-commerce permite a criação de lojas virtuais com gerenciamento de produtos, carrinho de compras e integração com meios de pagamento. Totalmente responsiva e desenvolvida com tecnologias modernas como Angular, Tailwind CSS e Node.js.",
  "viewOnGithub": "Ver no GitHub",
  "React.js": "React.js",
  "Redux Toolkit": "Redux Toolkit",
  "Chart.js": "Chart.js",
  "Tailwind CSS": "Tailwind CSS",
  "SCSS": "SCSS",
  "Angular": "Angular 19",
  "Node.js": "Node.js",
  "Express.js": "Express.js",
  "MongoDB": "MongoDB",
  "recipeManager": "Minhas Receitas",
  "recipeManagerDescription1": "O Gerenciador de Receitas é um projeto full stack robusto, que combina Angular no front-end e Node.js no back-end para oferecer uma integração perfeita entre a experiência do usuário e a lógica de servidor. A aplicação permite adicionar, editar, excluir e visualizar receitas classificadas em categorias abrangentes como Sobremesas, Pratos Principais, Aperitivos, Opções Saudáveis, Lanches e Bebidas.",
  "recipeManagerDescription2": "Além disso, conta com recursos para marcar receitas como favoritas, gerenciar o perfil do usuário e acompanhar conquistas dinâmicas, tornando o ato de cozinhar e compartilhar ainda mais envolvente. Desenvolvido com Angular, Node.js e SCSS, o projeto segue o conceito mobile first, mas é totalmente responsivo para diferentes tamanhos de tela.",
  "recipeManagerDescription3": "O design foi criado inteiramente do zero, sem o uso de bibliotecas externas, garantindo uma estética única e personalizada. Para aprimorar a experiência do usuário, o sistema incorpora animações suaves, resultando em uma navegação fluida e envolvente em todas as etapas de uso.",
  "CSS Grid": "CSS Grid",
  "Flexbox": "Flexbox",
  "Font Awesome": "Font Awesome",
  "cv": "O idioma do currículo será o mesmo selecionado na aplicação.",
  "imageAlt": "Imagem do projeto",
  "viewMore": "Saiba Mais",
  "Highlights": "Destaques",
  "financeTitle": "Portal Financiamento Auto",
  "financeDescription1": "O Portal Financiamento Auto é um sistema intuitivo e moderno desenvolvido para facilitar a gestão de contratos de financiamento. Ele permite que os usuários acompanhem suas prestações, gerem boletos, antecipem pagamentos e realizem a quitação do contrato com descontos exclusivos. Com uma interface amigável e responsiva, o portal garante praticidade e transparência no controle das obrigações financeiras.",
  "financeDescription2": "A aplicação foi construída utilizando Angular 19 com Standalone Components e Signals para um gerenciamento de estado eficiente. O design responsivo foi implementado com Tailwind CSS, assegurando uma experiência fluida em qualquer dispositivo. Além disso, o sistema conta com jsPDF para geração de boletos em PDF, RxJS para manipulação de dados assíncronos e Font Awesome para ícones interativos, tornando a plataforma completa e dinâmica",
  "financeDescription3": "O Portal Financiamento Auto tem como principal objetivo oferecer um ambiente seguro e eficiente para que os usuários possam ter total controle sobre seus pagamentos e contratos de financiamento. Através do portal, é possível visualizar e gerenciar parcelas, calcular descontos para quitação e emitir boletos de forma rápida e segura. Com essa solução, a gestão financeira se torna mais simples e acessível, ajudando os usuários a manterem suas contas organizadas e a evitarem inadimplência.",
  "plannerTitle": "Planejador de Posts",
  "plannerDescription1": "O Planejador de Posts é uma aplicação desenvolvida para auxiliar criadores de conteúdo na organização e planejamento de suas postagens em diferentes plataformas. O objetivo principal do projeto é fornecer uma interface intuitiva e eficiente para o gerenciamento de postagens futuras, garantindo que cada publicação seja agendada, editada e acompanhada de forma prática. Através de um calendário semanal, os usuários podem visualizar suas postagens planejadas, organizar conteúdos por data e manter um histórico detalhado de publicações.",
  "plannerDescription2": "Entre as principais funcionalidades, o sistema permite a adição de postagens com título, data, descrição e seleção de múltiplas plataformas. O carrossel de planejamento semanal exibe os dias da semana com o número de postagens agendadas, possibilitando uma navegação fácil entre as datas. Além disso, o feed planejado lista os posts de cada dia, permitindo ações como edição, exclusão e a marcação de publicações como 'abandonadas'. Um modal de detalhes também fornece um histórico dos posts de dias anteriores, garantindo que o usuário tenha total controle sobre seu conteúdo.",
  "plannerDescription3": "A aplicação foi desenvolvida utilizando React.js para a construção da interface, com Redux Toolkit para o gerenciamento global do estado. A estilização segue um design moderno e responsivo, utilizando Tailwind CSS e CSS Grid para garantir uma experiência fluida em diferentes dispositivos. O sistema de roteamento é implementado com React Router, permitindo a navegação entre as páginas de planejamento, criação de postagens, perfil do usuário e metas."


}
