{
  "HELLO": "Hello! I'm",
  "ALINE_NINK": "Aline Nink",
  "SUBTITLE": "Front-End Developer",
  "ABOUT_ME": "About Me",
  "English": "English",
  "Portuguese": "Portuguese",
  "Here’s a quick glance at my journey so far.": "Here’s a quick glance at my journey so far.",
  "technologies": {
    "title": "Skills",
    "subtitle": "Technologies and abilities I have mastered",
    "hardSkills": {
      "title": "Core Skills",
      "angularJs": "Angular JS",
      "angular": "Angular (up to version 18)",
      "css": "CSS (UX, CSS3, LESS, SASS, Bootstrap)",
      "html": "HTML",
      "apiIntegration": "API REST and GraphQL Integrations",
      "git": "Git",
      "javascript": "JavaScript",
      "testing": "Jasmine, Jest, and Karma (Unit Testing)",
      "methodologies": "Agile Methodologies",
      "ngrx": "NgRx",
      "typescript": "TypeScript",
      "microFrontend": "Micro-frontend Architecture",
      "english": "English",
      "azure": "Azure",
      "jenkins": "Jenkins (CI/CD)",
      "kubernetes": "Kubernetes"
    },
    "softSkills": {
      "title": "Developing Skills",
      "react": "React",
      "nextjs": "Next.js",
      "tailwind": "Tailwind CSS",
      "sql": "SQL",
      "nodejs": "Node.js",
      "java": "Java",
      "aws": "AWS",
      "vuejs": "Vue.js"
    }
  },
  "contact": {
    "title": "Contact Me",
    "subtitle": "Feel free to reach out through the options below:",
    "whatsapp": "Chat on WhatsApp",
    "email": "Email",
    "linkedin": "LinkedIn"
  },
  "home": "Home",
  "aboutMe": "About Me",
  "skills": "Skills",
  "projects": "Projects",
  "contactHeader": "Contact",
  "english": "English",
  "portuguese": "Portuguese",
  "allRightsReserved": "All Rights Reserved.",
  "madeBy": "Made with",
  "alineNink": "Aline Nink",
  "linkedIn": "LinkedIn",
  "gitHub": "GitHub",
  "email": "Email",
  "graduation": "Bachelor's in IT Management",
  "graduationDescription": "Completed my degree in IT Management at Fatec Itaquaquecetuba, building a strong foundation in technology.",
  "beginnerExperience": "Beginning of Career",
  "beginnerDescription": "Started my career as a Junior Developer, working with Angular 7, TypeScript, and HTML5 to create dynamic interfaces.",
  "intermediateExperience": "Intermediate Experience",
  "intermediateDescription": "Advanced to Mid-level Developer, contributing to financial sector projects using Angular 9 and GraphQL.",
  "postgraduateAgile": "Postgraduate in Agile Methodologies",
  "postgraduateAgileDescription": "Completed a postgraduate degree in Software Development with Agile Methodologies at Anhembi Morumbi University.",
  "advancedExperience": "Advanced Experience",
  "advancedDescription": "Worked as a Senior Developer, leading high-complexity projects in the real estate sector using Angular and NgRx.",
  "postgraduateUX": "Postgraduate in User Experience",
  "postgraduateUXDescription": "Enhanced my user-centered design knowledge with a specialization in UX at Anhembi Morumbi University.",
  "techLeadExperience": "Tech Lead Experience",
  "techLeadDescription": "Currently working as a Front-end Tech Lead, leading teams and delivering efficient solutions for financial and real estate clients.",
  "projectsTitle": "My Projects",
  "projectsSubtitle": "Here are some of the personal projects I’ve developed.",
  "description": "Description",
  "technologiesUsed": "Technologies Used",
  "financialDashboard": "Personal Finance Dashboard",
  "financialDashboardDescriptionP1": "The Personal Finance Dashboard is a comprehensive and intuitive tool designed to transform your financial management into a smooth and insightful experience. With a modern, user-friendly interface, it enables you to record detailed incomes and expenses organized by categories, ensuring precise control over your cash flow.",
  "financialDashboardDescriptionP2": "In addition, the dashboard offers extensive transaction histories, allowing you to deeply analyze your spending habits over time. Interactive and dynamic charts display trends, future projections, and spending percentages, turning raw data into valuable insights for informed decision-making.",
  "financialDashboardDescriptionP3": "Built with advanced technologies such as React.js, Redux, and Chart.js, the Personal Finance Dashboard is fully responsive, delivering an impeccable user experience on any device. To further enhance usability, the system features both light and dark modes, adapting to your visual preferences and environment.",
  "ecommercePlatform": "E-commerce Platform",
  "ecommercePlatformDescription": "The E-commerce Platform allows the creation of online stores with product management, shopping cart, and payment integration. Fully responsive and developed with modern technologies such as Angular, Tailwind CSS, and Node.js.",
  "viewOnGithub": "View on GitHub",
  "React.js": "React.js",
  "Redux Toolkit": "Redux Toolkit",
  "Chart.js": "Chart.js",
  "Tailwind CSS": "Tailwind CSS",
  "SCSS": "SCSS",
  "Angular": "Angular 19",
  "Node.js": "Node.js",
  "Express.js": "Express.js",
  "MongoDB": "MongoDB",
  "recipeManager": "My Recipes",
  "recipeManagerDescription1": "Recipe Manager is a robust full-stack application that seamlessly unites a dynamic Angular front end with a Node.js back end, delivering an outstanding user experience from interface to server logic. The system enables users to add, edit, delete, and explore an extensive range of recipes, neatly organized into categories such as Desserts, Main Dishes, Appetizers, Healthy Options, Snacks, and Drinks.",
  "recipeManagerDescription2": "Going beyond the basics, Recipe Manager features favorites, user profile management, and dynamic achievements, elevating the cooking and sharing experience to a new level of engagement. Developed with Angular, Node.js, and SCSS, the project follows a mobile-first philosophy while maintaining full responsiveness across various devices.",
  "recipeManagerDescription3": "Designed entirely from the ground up—without external libraries—the interface boasts a truly unique and personalized aesthetic. To further enrich the user experience, smooth animations have been integrated, ensuring fluid navigation and an elevated sense of interactivity at every step.",
  "CSS Grid": "CSS Grid",
  "Flexbox": "Flexbox",
  "Font Awesome": "Font Awesome",
  "cv": "The resume language will match the one selected in the application.",
  "imageAlt": "Project image",
  "viewMore": "Learn More",
  "Highlights": "Highlights",
  "financeTitle": "Auto Financing Portal",
  "financeDescription1": "The Auto Financing Portal is an intuitive and modern system designed to streamline the management of financing contracts. It allows users to track their installments, generate invoices, make advance payments, and settle contracts with exclusive discounts. With a user-friendly and responsive interface, the portal ensures convenience and transparency in financial management.",
  "financeDescription2": "The application is built using Angular 19, leveraging Standalone Components and Signals for efficient state management. The responsive design is powered by Tailwind CSS, ensuring a seamless experience across all devices. Additionally, the system integrates jsPDF for generating PDF invoices, RxJS for handling asynchronous data, and Font Awesome for interactive icons, making the platform both comprehensive and dynamic.",
  "financeDescription3": "The Auto Financing Portal aims to provide a secure and efficient environment for users to have full control over their payments and financing contracts. Through the portal, users can view and manage their installments, calculate early settlement discounts, and issue invoices quickly and securely. This solution simplifies financial management, helping users stay organized and avoid late payments.",
  "plannerTitle": "Post Planner",
  "plannerDescription1": "The Post Planner is an application designed to help content creators organize and schedule their posts across different platforms. The main goal of the project is to provide an intuitive and efficient interface for managing future posts, ensuring that each publication is scheduled, edited, and tracked in a practical way. Through a weekly calendar, users can visualize their planned posts, organize content by date, and maintain a detailed publication history.",
  "plannerDescription2": "Among its key features, the system allows users to add posts with a title, date, description, and selection of multiple platforms. The weekly planning carousel displays the days of the week with the number of scheduled posts, enabling easy navigation between dates. Additionally, the planned feed lists the posts for each day, allowing actions such as editing, deleting, and marking publications as 'abandoned.' A details modal also provides a history of posts from previous days, ensuring users have full control over their content.",
  "plannerDescription3": "The application was developed using React.js for building the interface, with Redux Toolkit for global state management. The styling follows a modern and responsive design, utilizing Tailwind CSS and CSS Grid to ensure a seamless experience across different devices."
}
